from steps import algorithm


# print('------------------------------------------------------------------')

# string1 = "!a+b!"
# print('Вход:', string1)
# print('Ожидаемый результат: [1, 3, 4, 6, 2, 4, 7]')
# print('Полученный результат:', algorithm(string1))

# print('------------------------------------------------------------------')

# string2 = "!a*b!"
# print('Вход:', string2)
# print('Ожидаемый результат: [1, 2, 5, 6, 4, 7]')
# print('Полученный результат:', algorithm(string2))

# print('------------------------------------------------------------------')

# string3 = "!(a+b)*(b+a)!"
# print('Входной набор:', string3)
# print('Ожидаемый результат: [1, 2, 5, 8, 3, 4, 6, 2, 4, 7, 4, 8, 3, 4, 7, 2, 4, 6]')
# print('Полученный результат:', algorithm(string3))

# print('------------------------------------------------------------------')

# string4 = "!b*a+a*b!"
# print('Входной набор:', string4)
# print('Ожидаемый результат: [1, 3, 5, 7, 4, 6, 2, 5, 6, 4, 7]')
# print('Полученный результат:', algorithm(string4))

# print('------------------------------------------------------------------')

# string5 = "!(a+b)*a+b*a!"
# print('Входной набор:', string5)
# print('Ожидаемый результат: [1, 3, 5, 8, 3, 4, 6, 2, 4, 7, 4, 6, 2, 5, 7, 4, 6]')
# print('Полученный результат:', algorithm(string5))

# print('------------------------------------------------------------------')

# string6 = "!(a+b*a)*(b*b+a*(a+b+a))!"
# print('Входной набор:', string6)
# print('Ожидаемый результат: [1, 2, 5, 8, 3, 4, 6, 2, 5, 7, 4, 6, 4, 8, 3, 5, 7, 4, 7, 2, 5, 6, 4, 8, 3, 4, 6, 3, 4, 7, 2, 4, 6]')
# print('Полученный результат:', algorithm(string6))

# print('------------------------------------------------------------------')

# string7 = '!a+*b!'
# print('Входной набор:', string7)
# print('Ожидаемый результат: "Ошибка"')
# print('Полученный результат:', algorithm(string7))

# print('------------------------------------------------------------------')

# string8 = 'a+b*a+b'
# print('Входной набор:', string8)
# print('Ожидаемый результат: "Ошибка"')
# print('Полученный результат:', algorithm(string8))

# print('------------------------------------------------------------------')

# string9 = 'a!b'
# print('Входной набор:', string9)
# print('Ожидаемый результат: "Ошибка"')
# print('Полученный результат:', algorithm(string9))

# print('------------------------------------------------------------------')

# string10 = '!a(b+a()!'
# print('Входной набор:', string10)
# print('Ожидаемый результат: "Ошибка"')
# print('Полученный результат:', algorithm(string10))

# print('------------------------------------------------------------------')

string11 = '!(a+a)*(a+b)*(b+b)!'
print('Входной набор:', string11)
print('Полученный результат:', algorithm(string11))

print('------------------------------------------------------------------')