from algorithm import algorithm

# print('------------------------------------------------------------------')

# string1 = "!a+b!"
# print('Входной набор:', string1)
# print('Полученный результат:', algorithm(string1))

# print('------------------------------------------------------------------')

# string2 = "!a*b!"
# print('Входной набор:', string2)
# print('Полученный результат:', algorithm(string2))

# print('------------------------------------------------------------------')

# string3 = "!(a+b)*(b+a)!"
# print('Входной набор:', string3)
# print('Полученный результат:', algorithm(string3))

# print('------------------------------------------------------------------')

# string4 = "!a+b!!"
# print('Входной набор:', string4)
# print('Полученный результат:', algorithm(string4))

# print('------------------------------------------------------------------')

# string5 = "(!a+b!"
# print('Входной набор:', string5)
# print('Полученный результат:', algorithm(string5))

# print('------------------------------------------------------------------')

# string6 = "!c+b!"
# print('Входной набор:', string6)
# print('Полученный результат:', algorithm(string6))

# print('------------------------------------------------------------------')

string7 = "!a+b*(b+a)!"
print('Входной набор:', string7)
print('Полученный результат:', algorithm(string7))

print('------------------------------------------------------------------')
